app/views/shared/_menu.html.haml

        %ul.sub-menu#sub-pages
          - Page.all.each do |page|
---
SELECT `pages`.* FROM `pages`