app/views/sub_groups/_form.html.haml

      = f.label 'گروه مربوط را انتخاب کنید.', :class => "control-label"
      = f.select :category_id, options_for_select(Category.all.collect{ |u| [u.title_fa, u.id] }), prompt: "گروه فعالیت ها را انتخاب کنید.", :class => "form-control"
---
SELECT `categories`.* FROM `categories`