app/controllers/categories_controller.rb

  def index
    @categories = Category.all
---
SELECT `categories`.* FROM `categories`

  def create
    @category = Category.new(category_params)

    respond_to do |format|
      if @category.save
---
INSERT INTO `categories` (`created_at`, `description_en`, `description_fa`, `title_en`, `title_fa`, `updated_at`) VALUES ('2014-12-30 08:18:33', '', '', 'Commercial', 'بازرگانی', '2014-12-30 08:18:33')

    def set_category
      @category = Category.friendly.find(params[:id])
---
SELECT `categories`.* FROM `categories` WHERE `categories`.`id` = 1 LIMIT 1