app/controllers/products_controller.rb

  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save
---
INSERT INTO `products` (`created_at`, `description`, `description_fa`, `sub_group_id`, `title`, `title_fa`, `updated_at`) VALUES ('2014-12-31 07:27:07', 'سیب سیب سی', 'سیب سیب ', 1, 'project 1', 'پروژه اول', '2014-12-31 07:27:07')