app/controllers/slides_controller.rb

SELECT `slides`.* FROM `slides`
---
  def index
    @slides = Slide.all