app/controllers/sub_groups_controller.rb

SELECT `sub_groups`.* FROM `sub_groups`
---
  def index
    @sub_groups = SubGroup.all

INSERT INTO `sub_groups` (`category_id`, `created_at`, `description_en`, `description_fa`, `title_en`, `title_fa`, `updated_at`) VALUES (1, '2014-12-31 07:26:25', '', '', 'g fdf gdf', 'للللللللللللللللللللل', '2014-12-31 07:26:25')
---
  def create
    @sub_group = SubGroup.new(sub_group_params)

    respond_to do |format|
      if @sub_group.save