app/controllers/users_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`user_name` = 'admin' ORDER BY `users`.`id` ASC LIMIT 1
---
  def create_session
    user = User.where(:user_name => params[:user_name]).first