app/views/products/_form.html.haml

SELECT `sub_groups`.* FROM `sub_groups`
---
        = f.label 'زیرگروه مربوط را انتخاب کنید.', :class => "control-label"
        = f.select :sub_group_id, options_for_select(SubGroup.all.collect{ |u| [u.title_fa, u.id] }), prompt: "زیرگروه فعالیت ها را انتخاب کنید.", :class => "form-control"
    .col-xs-12
      .form-group.col-xs-12